package com.amk.follower.util

data class FaqData(
    val question: String,
    val answer: String
)

val faqList = listOf(
    FaqData(
        question = "من از فروشگاه خرید کرده‌ام ولی به کیف پولم واریز نشده. چرا؟",
        answer = "در صورتی که از بخش فروشگاه اقدام به افزایش موجودی کیف پول خود کرده‌اید و با خطا مواجه شده‌اید، ابتدا اگر فیلترشکن روشن هست خاموش نموده و مجدد روی همان محصول کلیک نمایید تا خرید بررسی و به کیف پول واریز شود. در صورتی که مشکل شما حل نشد بایستی توکن خرید خود را از اپلیکیشن کافه بازار از بخش تراکنش‌ها گرفته و همراه شماره‌تلفن خود از طریق بخش پشتیبانی برای ما ارسال نمایید تا حداکثر ظرف ۷۲ ساعت بررسی و مبلغ به شما عودت داده شود."
    ),
    FaqData(
        question = "آیا امکان لغو سفارش وجود دارد؟",
        answer = "متاسفانه پس از ثبت سفارش امکان لغو وجود ندارد، چون سفارش شما به سرور ارسال شده و قابل لغو نیست، پس لطفا در ثبت سفارش دقت نمایید."
    ),
    FaqData(
        question = "مبلغ از کیف پول کسر شده ولی سفارش انجام نشده. چرا؟",
        answer = "سفارشاتی که آیدی یا لینک آن‌ها اشتباه باشد به صورت خودکار لغو می‌شوند، بنابراین دقت نمایید در بخش مربوطه اطلاعات صحیح خواسته شده را وارد نمایید.\nدر صورتی که در بخش مربوطه اطلاعات صحیح را وارد کرده‌اید و سفارش لغو شده، کافیست شناسه سفارش را از بخش سفارشات دریافت کرده و از بخش پشتیبانی برای ما ارسال نمایید تا ظرف حداکثر ۷۲ ساعت بررسی خواهد شد."
    ),
    FaqData(
        question = "چرا سفارش من خطا خورده؟",
        answer = "در صورتی که سفارش تکراری بر روی یک لینک یا یوزرنیم ثبت نمایید سفارش خطا خواهد خورد، بنابراین صبر نمایید تا سفارش بر روی این لینک یا یوزرنیم تکمیل شود و مجدد ثبت سفارش نمایید.\nهمچنین سفارشات خطا خورده نیز توسط ما، در صورتی که میسر باشد رفع مشکل شده و حداکثر ظرف مدت ۱۲ ساعت رسیدگی و مجدد ارسال می‌شود و در صورتی که مشکل آن قابل حل نباشد لغو می شود."
    ),
    FaqData(
        question = "آیا من باید رمز حسابم را در اختیار شما قرار دهم؟",
        answer = "خیر، کافیست نام‌کاربری حساب خود را وارد نمایید."
    ),
    FaqData(
        question = "علت ارزانی خدمات شما چیست؟",
        answer = "علت این هست که شما مستقیما از ارائه دهنده خدمات استفاده می کنید و سفارشات با بالاترین سرعت و کیفیت ارسال می شوند."
    ),
    FaqData(
        question = "آیا اطلاعات من محرمانه باقی خواهند ماند؟",
        answer = "بله، برای ورود و ثبت‌نام در برنامه شما از حساب بازار خود استفاده می‌کنید و تمامی اطلاعات اعم از موجودی حساب، تراکنش‌ها و سفارشات شما در سرورهای امن بازار قرار می‌گیرند."
    )
)